---
kind: property
id: P:Autodesk.Revit.DB.STLExportOptions.TargetUnit
source: html/859f84f4-d7a5-8be3-d1ad-5a664d58172c.htm
---
# Autodesk.Revit.DB.STLExportOptions.TargetUnit Property

The unit type of geometry in the resultant STL file.
 Default value is ExportUnit::Default.

## Syntax (C#)
```csharp
public ExportUnit TargetUnit { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration